.tmp/be.log
# express
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            3000

Document Path:          /api/messages/greet
Document Length:        23 bytes

Concurrency Level:      100
Time taken for tests:   1.998 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2340000 bytes
HTML transferred:       230000 bytes
Requests per second:    5003.94 [#/sec] (mean)
Time per request:       19.984 [ms] (mean)
Time per request:       0.200 [ms] (mean, across all concurrent requests)
Transfer rate:          1143.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:     2   20  20.2     15     223
Waiting:        2   20  20.2     15     223
Total:          4   20  20.2     16     223

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     20
  75%     21
  80%     22
  90%     24
  95%     27
  98%     33
  99%     36
 100%    223 (longest request)